Ran Plan for 2 projects:

1. project: `crawlinghub-ecs-web-api-prod` dir: `terraform/ecs-web-api` workspace: `default`
1. project: `crawlinghub-ecs-scheduler-prod` dir: `terraform/ecs-scheduler` workspace: `default`
---

### 1. project: `crawlinghub-ecs-web-api-prod` dir: `terraform/ecs-web-api` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/61/default/terraform/ecs-web-api/crawlinghub-ecs-web-api-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/61/default/terraform/ecs-web-api": exit status 1
data.aws_elasticache_cluster.redis: Reading...
data.aws_ssm_parameter.eventbridge_trigger_queue_arn: Reading...
data.aws_ssm_parameter.eventbridge_role_arn: Reading...
module.ecs_task_role.data.aws_caller_identity.current: Reading...
data.aws_ecs_cluster.main: Reading...
data.aws_ssm_parameter.route53_zone_id: Reading...
module.ecs_service.data.aws_region.current: Reading...
module.ecs_task_execution_role.aws_iam_role.this: Refreshing state... [id=crawlinghub-web-api-execution-role-prod]
data.aws_ssm_parameter.amp_workspace_arn: Reading...
data.aws_ssm_parameter.public_subnets: Reading...
module.ecs_service.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_ssm_parameter.private_subnets: Reading...
module.ecs_task_role.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ecr_repository.web_api: Reading...
data.aws_ssm_parameter.private_subnets: Read complete after 0s [id=/shared/network/private-subnets]
data.aws_ssm_parameter.route53_zone_id: Read complete after 0s [id=/shared/network/route53-zone-id]
module.ecs_task_role.aws_iam_role.this: Refreshing state... [id=crawlinghub-web-api-task-role-prod]
data.aws_ssm_parameter.service_discovery_namespace_id: Reading...
data.aws_ssm_parameter.public_subnets: Read complete after 0s [id=/shared/network/public-subnets]
data.aws_ssm_parameter.amp_workspace_arn: Read complete after 0s [id=/shared/monitoring/amp-workspace-arn]
data.aws_ssm_parameter.amp_remote_write_url: Reading...
data.aws_secretsmanager_secret.rds: Reading...
data.aws_ssm_parameter.eventbridge_role_arn: Read complete after 0s [id=/crawlinghub/eventbridge/role-arn]
data.aws_ssm_parameter.eventbridge_trigger_queue_arn: Read complete after 0s [id=/crawlinghub/sqs/eventbridge-trigger-queue-arn]
module.ecs_task_execution_role.data.aws_caller_identity.current: Reading...
data.aws_ssm_parameter.amp_workspace_id: Reading...
module.ecs_task_execution_role.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ecs_cluster.main: Read complete after 0s [id=arn:aws:ecs:ap-northeast-2:646886795421:cluster/crawlinghub-cluster-prod]
module.ecs_task_execution_role.data.aws_region.current: Reading...
module.ecs_task_execution_role.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
module.ecs_task_role.data.aws_region.current: Reading...
module.web_api_logs.aws_cloudwatch_log_group.this: Refreshing state... [id=/aws/ecs/crawlinghub-web-api-prod/application]
module.ecs_task_role.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_ssm_parameter.amp_remote_write_url: Read complete after 0s [id=/shared/monitoring/amp-remote-write-url]
data.aws_ssm_parameter.certificate_arn: Reading...
data.aws_ssm_parameter.service_discovery_namespace_id: Read complete after 0s [id=/shared/service-discovery/namespace-id]
module.ecs_service.data.aws_caller_identity.current: Reading...
data.aws_ssm_parameter.vpc_id: Reading...
module.ecs_service.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_secretsmanager_secret.rds: Read complete after 0s [id=arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:crawlinghub/rds/credentials-6wYxDG]
data.aws_ssm_parameter.amp_workspace_id: Read complete after 0s [id=/shared/monitoring/amp-workspace-id]
data.aws_ssm_parameter.certificate_arn: Read complete after 0s [id=/shared/network/certificate-arn]
data.aws_secretsmanager_secret_version.rds: Reading...
module.ecs_service.aws_service_discovery_service.this[0]: Refreshing state... [id=srv-rmpdjkdm77pn66ko]
data.aws_ssm_parameter.vpc_id: Read complete after 1s [id=/shared/network/vpc-id]
data.aws_vpc.main: Reading...
module.alb.aws_lb_target_group.this["web-api"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:targetgroup/crawlinghub-alb-prod-web-api/317bc1ed4a01878e]
module.alb_security_group.aws_security_group.this: Refreshing state... [id=sg-08eb1fa30c689e592]
data.aws_elasticache_cluster.redis: Read complete after 1s [id=crawlinghub-redis-prod]
data.aws_secretsmanager_secret_version.rds: Read complete after 1s [id=arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:crawlinghub/rds/credentials-6wYxDG|AWSCURRENT]
module.ecs_security_group.aws_security_group.this: Refreshing state... [id=sg-02997a2675e266a40]
module.alb_security_group.aws_vpc_security_group_ingress_rule.alb-https["0.0.0.0/0"]: Refreshing state... [id=sgr-00a0bb1d5c9abb669]
module.alb.aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/crawlinghub-alb-prod/d1dbe35850991a10]
module.alb_security_group.aws_vpc_security_group_ingress_rule.alb-http["0.0.0.0/0"]: Refreshing state... [id=sgr-07cd584511154f7cc]
module.alb_security_group.aws_vpc_security_group_egress_rule.default[0]: Refreshing state... [id=sgr-062609eabf13aa506]
module.ecs_security_group.aws_vpc_security_group_egress_rule.default[0]: Refreshing state... [id=sgr-0c787c9cabd647494]
module.ecs_security_group.aws_vpc_security_group_ingress_rule.ecs-from-alb[0]: Refreshing state... [id=sgr-0180eebfd172b62e6]
data.aws_ecr_repository.web_api: Read complete after 1s [id=crawlinghub-web-api-prod]
module.alb.aws_lb_listener.https["https"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:listener/app/crawlinghub-alb-prod/d1dbe35850991a10/eb7439e00b2187d4]
aws_route53_record.web_api: Refreshing state... [id=Z104656329CL6XBYE8OIJ_crawler.set-of.com_A]
module.alb.aws_lb_listener.http["http-redirect"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:listener/app/crawlinghub-alb-prod/d1dbe35850991a10/b70f198886f99ce7]
data.aws_vpc.main: Read complete after 0s
module.ecs_security_group.aws_vpc_security_group_ingress_rule.custom["0"]: Refreshing state... [id=sgr-069fd56adac03d65c]
module.ecs_task_execution_role.aws_iam_role_policy.secrets-manager[0]: Refreshing state... [id=crawlinghub-web-api-execution-role-prod:crawlinghub-web-api-execution-role-prod-secrets-manager]
module.ecs_task_execution_role.aws_iam_role_policy_attachment.aws-managed["arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"]: Refreshing state... [id=crawlinghub-web-api-execution-role-prod-20251128025726549700000001]
module.ecs_task_execution_role.aws_iam_role_policy.custom["ssm-access"]: Refreshing state... [id=crawlinghub-web-api-execution-role-prod:crawlinghub-web-api-execution-role-prod-ssm-access]
module.ecs_task_role.aws_iam_role_policy.custom["eventbridge-access"]: Refreshing state... [id=crawlinghub-web-api-task-role-prod:crawlinghub-web-api-task-role-prod-eventbridge-access]
module.ecs_task_role.aws_iam_role_policy.custom["adot-amp-access"]: Refreshing state... [id=crawlinghub-web-api-task-role-prod:crawlinghub-web-api-task-role-prod-adot-amp-access]
module.ecs_service.aws_ecs_task_definition.this: Refreshing state... [id=crawlinghub-web-api-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # module.ecs_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-web-api-prod:77" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-web-api-prod" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "crawlinghub-web-api-prod" -> (known after apply)
      ~ revision                 = 77 -> (known after apply)
        tags                     = {
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Description" = "ECS task definition for crawlinghub-web-api-prod"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "crawlinghub-web-api-prod"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "crawlinghub"
            "Service"     = "crawlinghub-web-api"
        }
        # (12 unchanged attributes hidden)
    }

  # module.ecs_task_role.aws_iam_role_policy.custom["adot-amp-access"] will be updated in-place
  ~ resource "aws_iam_role_policy" "custom" {
        id          = "crawlinghub-web-api-task-role-prod:crawlinghub-web-api-task-role-prod-adot-amp-access"
        name        = "crawlinghub-web-api-task-role-prod-adot-amp-access"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action   = [
                            "xray:PutTraceSegments",
                            "xray:PutTelemetryRecords",
                            "xray:GetSamplingRules",
                            "xray:GetSamplingTargets",
                            "xray:GetSamplingStatisticSummaries",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = "XRayTracing"
                    },
                  ~ {
                      ~ Resource = "arn:aws:s3:::connectly-prod/*" -> "arn:aws:s3:::prod-connectly/otel-config/*"
                      ~ Sid      = "S3ConfigAccess" -> "S3OtelConfigAccess"
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ task_definition_arn = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-web-api-prod:77" -> (known after apply)
╷
│ Error: reading Service Discovery Service (srv-rmpdjkdm77pn66ko): operation error ServiceDiscovery: GetService, https response error StatusCode: 400, RequestID: 3b363b23-82fc-4995-9189-186bbf105b7d, api error AccessDeniedException: User: arn:aws:sts::646886795421:assumed-role/atlantis-ecs-task-prod/c0393a9794c64774b56dbd940f473b7a is not authorized to perform: servicediscovery:GetService on resource: arn:aws:servicediscovery:ap-northeast-2:646886795421:service/srv-rmpdjkdm77pn66ko because no identity-based policy allows the servicediscovery:GetService action
│ 
│   with module.ecs_service.aws_service_discovery_service.this[0],
│   on .terraform/modules/ecs_service/terraform/modules/ecs-service/main.tf line 150, in resource "aws_service_discovery_service" "this":
│  150: resource "aws_service_discovery_service" "this" {
│ 
╵

```
</details>

---
### 2. project: `crawlinghub-ecs-scheduler-prod` dir: `terraform/ecs-scheduler` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs_service.aws_ecs_service.this will be updated in-place
~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/crawlinghub-cluster-prod/crawlinghub-scheduler-prod"
        name                               = "crawlinghub-scheduler-prod"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Description" = "ECS service for crawlinghub-scheduler-prod"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "crawlinghub-scheduler-prod"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "crawlinghub"
            "Service"     = "crawlinghub-scheduler"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-scheduler-prod:63" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-scheduler-prod:63" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-scheduler-prod" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "crawlinghub-scheduler-prod" -> (known after apply)
      ~ revision                 = 63 -> (known after apply)
        tags                     = {
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Description" = "ECS task definition for crawlinghub-scheduler-prod"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "crawlinghub-scheduler-prod"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "crawlinghub"
            "Service"     = "crawlinghub-scheduler"
        }
        # (12 unchanged attributes hidden)
    }

  # module.scheduler_task_role.aws_iam_role_policy.custom["adot-amp-access"] will be updated in-place
~ resource "aws_iam_role_policy" "custom" {
        id          = "crawlinghub-scheduler-task-role-prod:crawlinghub-scheduler-task-role-prod-adot-amp-access"
        name        = "crawlinghub-scheduler-task-role-prod-adot-amp-access"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action   = [
                            "xray:PutTraceSegments",
                            "xray:PutTelemetryRecords",
                            "xray:GetSamplingRules",
                            "xray:GetSamplingTargets",
                            "xray:GetSamplingStatisticSummaries",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = "XRayTracing"
                    },
                  ~ {
                      ~ Resource = "arn:aws:s3:::connectly-prod/*" -> "arn:aws:s3:::prod-connectly/otel-config/*"
                      ~ Sid      = "S3ConfigAccess" -> "S3OtelConfigAccess"
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
~ task_definition_arn = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-scheduler-prod:63" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p crawlinghub-ecs-scheduler-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FCrawlingHub%252Fterraform%252Fecs-scheduler%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p crawlinghub-ecs-scheduler-prod
  ```
Plan: 1 to add, 2 to change, 1 to destroy.

---
### Plan Summary

2 projects, 1 with changes, 0 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```